## Dataframe

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.seed(100)

In [4]:
dataku = pd.DataFrame(np.random.randn(3,5),['A','B','C'],['satu','dua','tiga','empat','lima'])

In [5]:
dataku

       satu       dua      tiga     empat      lima
A -1.749765  0.342680  1.153036 -0.252436  0.981321
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721

In [6]:
dataku['dua']

A    0.342680
B    0.221180
C    0.435163
Name: dua, dtype: float64

In [7]:
#bisa slicing dengan iloc dan loc

In [8]:
#menambah kolom baru
dataku['baru'] = dataku['empat'] + dataku['lima']

In [9]:
dataku

       satu       dua      tiga     empat      lima      baru
A -1.749765  0.342680  1.153036 -0.252436  0.981321  0.728885
B  0.514219  0.221180 -1.070043 -0.189496  0.255001  0.065506
C -0.458027  0.435163 -0.583595  0.816847  0.672721  1.489568

In [10]:
#menghapus kolom sementara
#axis = 1 adalah kolom
#axis = 0 adalah baris
dataku.drop('tiga', axis = 1)

       satu       dua     empat      lima      baru
A -1.749765  0.342680 -0.252436  0.981321  0.728885
B  0.514219  0.221180 -0.189496  0.255001  0.065506
C -0.458027  0.435163  0.816847  0.672721  1.489568

In [11]:
#hanya hilang bersifat sementara
dataku

       satu       dua      tiga     empat      lima      baru
A -1.749765  0.342680  1.153036 -0.252436  0.981321  0.728885
B  0.514219  0.221180 -1.070043 -0.189496  0.255001  0.065506
C -0.458027  0.435163 -0.583595  0.816847  0.672721  1.489568

In [12]:
#jika ingin hilang untuk selamanya
dataku = dataku.drop('tiga', axis = 1)

In [13]:
dataku

       satu       dua     empat      lima      baru
A -1.749765  0.342680 -0.252436  0.981321  0.728885
B  0.514219  0.221180 -0.189496  0.255001  0.065506
C -0.458027  0.435163  0.816847  0.672721  1.489568

In [15]:
#cara cepatnya untuk menghapus kolom selamanya
dataku.drop('baru', axis = 1, inplace = True)

In [16]:
dataku

       satu       dua     empat      lima
A -1.749765  0.342680 -0.252436  0.981321
B  0.514219  0.221180 -0.189496  0.255001
C -0.458027  0.435163  0.816847  0.672721

In [17]:
#untuk menghapus baris
dataku.drop('B', axis = 0)

       satu       dua     empat      lima
A -1.749765  0.342680 -0.252436  0.981321
C -0.458027  0.435163  0.816847  0.672721

In [18]:
dataku

       satu       dua     empat      lima
A -1.749765  0.342680 -0.252436  0.981321
B  0.514219  0.221180 -0.189496  0.255001
C -0.458027  0.435163  0.816847  0.672721

In [20]:
#untuk mengetahui dimensi dari dataku
dataku.shape

(3, 4)

In [22]:
#untuk komparasi / perbandingan
dataku_bool = dataku > -1

In [23]:
dataku_bool

    satu   dua  empat  lima
A  False  True   True  True
B   True  True   True  True
C   True  True   True  True

In [24]:
dataku

       satu       dua     empat      lima
A -1.749765  0.342680 -0.252436  0.981321
B  0.514219  0.221180 -0.189496  0.255001
C -0.458027  0.435163  0.816847  0.672721

In [26]:
#memberi nilai nan ke data > -1
dataku[dataku_bool]

       satu       dua     empat      lima
A       NaN  0.342680 -0.252436  0.981321
B  0.514219  0.221180 -0.189496  0.255001
C -0.458027  0.435163  0.816847  0.672721

In [27]:
dataku = pd.DataFrame(np.random.randn(3,5),['A','B','C'],['satu','dua','tiga','empat','lima'])

In [28]:
dataku

       satu       dua      tiga     empat      lima
A -0.104411 -0.531280  1.029733 -0.438136 -1.118318
B  1.618982  1.541605 -0.251879 -0.842436  0.184519
C  0.937082  0.731000  1.361556 -0.326238  0.055676

In [30]:
#menampilkan data tiga yang lebih besar dari nol
dataku[dataku['tiga'] > 0]

       satu      dua      tiga     empat      lima
A -0.104411 -0.53128  1.029733 -0.438136 -1.118318
C  0.937082  0.73100  1.361556 -0.326238  0.055676